using System.Text.RegularExpressions;

namespace Xorate.Helpers
{
    public class TagsHelper
    {
        private static HashSet<string> stopWords = new HashSet<string>
        {
            "и", "в", "на", "с", "по", "что", "как", "к", "у", "о", "за", "от", "но", "так", "это", "для", "а", "же", "из", "его", "её", "их", "он", "она", "оно", "они", "мы", "вы", "ты", "этом",
            "этим", "набор", "можно", "нужно", "если", "поэтому", "все", "будет", "будут", "или", "нет", "да", "уже", "ещё", "был", "были", "было", "быть", "есть", "есть", "была", "потому", "тогда",
            "себя", "вам", "всего", "очень", "такой", "такие", "такое", "такая", "более", "меньше", "много", "сейчас", "больше", "один", "одна", "одно", "два", "три", "четыре", "пять", "шесть",
            "семь", "восемь", "девять", "десять", "и", "или", "на", "в", "с", "под", "над", "между", "из-за", "из-под", "вне", "после", "перед", "вместо", "ради", "через", "среди", "о", "про",
            "об", "при", "около", "возле", "путём", "посредством", "благодаря", "согласно", "вследствие", "по", "против", "среди", "между", "за", "перед", "во", "со", "из", "под", "над", "без",
            "уже", "еще", "весь", "тоже", "более", "меньше", "через", "близко", "рядом", "близ", "вместе", "далеко", "здесь", "туда", "сюда", "отсюда", "везде", "нигде", "всегда", "никогда",
            "давно", "раньше", "позже", "сначала", "потом", "вновь", "снова", "зачем", "почему", "как", "так", "очень", "совсем", "довольно", "достаточно", "слишком", "весьма", "абсолютно",
            "очевидно", "видимо", "пожалуй", "наверное", "конечно", "безусловно", "естественно", "может", "возможно", "вероятно", "наконец", "итак", "значит", "следовательно", "однако",
            "наоборот", "все-таки", "кстати", "во-первых", "во-вторых", "в-третьих", "между тем", "действительно", "впрочем", "причем", "притом", "итого", "вдобавок", "например", "вместо",
            "вслед", "кроме", "начиная", "кончая", "путем", "среди", "посредством", "включая", "исключая", "несмотря", "поэтому", "соответственно", "теперь", "сегодня", "завтра", "вчера",
            "вечером", "утром", "днём", "ночью", "летом", "зимой", "весной", "осенью", "долго", "недавно", "только", "скоро", "сразу", "вдруг", "пока", "рано", "поздно", "вместе", "отдельно",
            "пополам", "вместе", "поровну", "единогласно", "пополам", "заодно", "согласованно", "совместно", "взаимно", "дружественно", "кто", "что", "кого", "кому", "кем", "чем", "ком",
            "чьей", "чьи", "чьё", "какой", "который", "чей", "чья", "чьё", "чьи", "какой-либо", "какие-либо", "какие-то", "какие-нибудь", "кто-то", "кто-либо", "чей-то", "какой-то", "кого-то",
            "чей-то", "кто-нибудь", "чей-нибудь", "чьё-нибудь", "какой-нибудь", "кому-то", "кому-либо", "кем-то", "кем-либо", "кем-нибудь", "кого-то", "чего-то", "что-либо", "чем-то",
            "чем-либо", "чем-нибудь", "какой-нибудь", "когда", "где", "зачем", "почему", "как", "почему-то", "зачем-то", "когда-либо", "когда-нибудь", "где-то", "где-нибудь", "зачем-нибудь",
            "почему-нибудь", "и", "в", "на", "с", "по", "что", "как", "к", "у", "о", "за", "от", "но", "так", "это", "для", "а", "же", "из", "его", "её", "их", "он", "она", "оно", "они", "мы",
            "вы", "ты", "этом", "этим", "набор", "можно", "нужно", "если", "поэтому", "все", "будет", "будут", "так", "же", "ни", "даже", "там", "лишь", "вот", "уже", "ну", "либо", "более",
            "быть", "все", "мне", "это", "есть", "того", "также", "когда", "себя", "может", "при", "чтобы", "без", "да", "нибудь", "тот", "тем", "раз", "совсем", "ведь", "разве", "пусть",
            "пути", "другие", "им", "самый", "после", "опять", "вообще", "совсем", "тогда", "вас", "уже", "здесь", "тоже", "всех", "можно", "такой", "этот", "раз", "надо", "любой", "очень",
            "дело", "нибудь", "время", "нельзя", "никак", "теперь", "наш", "чем", "ведь", "тебя", "нем", "ничего", "другой", "могу", "перед", "снова", "такой", "во", "над", "через", "рядом",
            "много", "надо", "вместе", "совсем", "хотя", "между", "вокруг", "назад", "куда", "слишком", "уж", "лучше", "мимо", "почти", "чуть", "где-то", "ли", "очень", "ещё", "вроде", "вместо",
            "например", "наконец", "поэтому", "снова", "несмотря", "из-за", "либо", "зато", "однако", "прямо", "сперва", "тут", "всё", "много", "ещё", "лишь", "поэтому", "такой", "тот", "поэтому",
            "очень", "надо", "всегда", "ещё", "тогда", "между", "который", "друг", "через", "вместо", "пример", "делать", "надо", "снова", "много", "наш", "из-за", "несмотря", "лишь", "тоже",
            "где", "уже", "тогда", "такой", "поэтому", "много", "также", "из-за", "друг", "вместо", "например", "тогда", "раз", "уже", "такой", "либо", "пока", "где", "без", "когда", "надо",
            "прямо", "снова", "несмотря", "мимо", "где", "когда", "также", "такие", "совсем", "пока", "который", "через", "тогда", "такой", "между", "надо", "когда", "снова", "например",
            "также", "мимо", "где", "например", "тоже", "снова", "где", "такой", "тогда"
        };

        public static string GetTags(string text)
        {
            var cleanedText = Regex.Replace(text.ToLower(), @"[^\w\s]", "");
            var words = cleanedText.Split(new[] { ' ', '\t', '\n', '\r' }, StringSplitOptions.RemoveEmptyEntries);
            var wordFrequency = new Dictionary<string, int>();
            foreach (var word in words)
            {
                if (word.Length >= 3 && !stopWords.Contains(word))
                {
                    if (wordFrequency.ContainsKey(word))
                    {
                        wordFrequency[word]++;
                    }
                    else
                    {
                        wordFrequency[word] = 1;
                    }
                }
            }
            return wordFrequency.OrderByDescending(x => x.Value)
                           .Take(5).Select(x => x.Key)
                           .Aggregate((current, next) => current + " " + next);
        }
    }
}
